app/controllers/api/users_controller.rb

  def create
  name = params[:name]
  email = params[:email]
  password_digest = params[:password_digest]
  user = User.new(name: name, email: email, password_digest: password_digest)
  if user.save
---
INSERT INTO "users" ("email", "password_digest", "role", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["email", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["role", nil], ["name", "Carlos López"], ["created_at", "2025-03-04 02:10:37.326444"], ["updated_at", "2025-03-04 02:10:37.326444"]]